app/controllers/expenses_controller.rb

  def expense
    @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]