app/controllers/expenses_controller.rb

  def create
    @expense = Expense.new(expense_params.merge(user: current_user))

    respond_to do |format|
      if @expense.save
---
INSERT INTO "expenses" ("name", "expense_value", "category", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Cachorrada e gataida"], ["expense_value", 555.0], ["category", 3], ["user_id", 1], ["created_at", "2024-09-18 17:00:00.446797"], ["updated_at", "2024-09-18 17:00:00.446797"]]

  def update
    respond_to do |format|
      if @expense.update(expense_params)
---
UPDATE "expenses" SET "name" = ?, "expense_value" = ?, "category" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["name", "Curso do Jackson Pires"], ["expense_value", 400.0], ["category", 5], ["updated_at", "2024-09-18 18:06:26.749243"], ["id", 5]]

  def destroy
    @expense = Expense.find(params[:id])
    @expense.destroy
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 3]]

  def expense
    @expense ||= Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]