app/controllers/goals_controller.rb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @goal = Goal.find_by(user: current_user)

INSERT INTO "goals" ("fixed_cost", "comfort", "goals", "pleasures", "financial_freedom", "knowledge", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @goal = current_user.goals.build(goal_params)

    if @goal.save

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def goal
    @goal ||= Goal.find(params[:id])