app/controllers/home_controller.rb

  def index
    redirect_to new_user_session_path unless current_user

    @goal = Goal.find_by(user: current_user)
    @incomes = Income.where(user: current_user)
    @expenses = Expense.where(user: current_user)
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]