app/controllers/incomes_controller.rb

  def create
    @income = Income.new(income_params.merge(user: current_user))

    respond_to do |format|
      if @income.save
---
INSERT INTO "incomes" ("monthly_income", "month", "user_id", "created_at", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["monthly_income", 8000.0], ["month", 12], ["user_id", 1], ["created_at", "2024-09-18 16:07:35.936999"], ["updated_at", "2024-09-18 16:07:35.936999"], ["year", nil]]