app/models/user.rb

  def create_goals
    Goal.create!(user_id: id, fixed_cost: 30, comfort: 15, goals: 10, pleasures: 10, financial_freedom: 30,
                 knowledge: 5)
---
INSERT INTO "goals" ("fixed_cost", "comfort", "goals", "pleasures", "financial_freedom", "knowledge", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"